# First Step in Data World !

### CSV Files

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("yourfilename.csv",)

In [3]:
df

  name  age   pet
0  Bob   20   cat
1  Jen   30   dog
2  Tim   40  bird

### Excel Files

In [4]:
data=pd.read_excel('test_pandas.xlsm','Sheet1')

C:\Users\ahmet\anaconda3\lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [5]:
data

   Column A Column B  Column C
0         1      cat       1.1
1         2      dog       2.2
2         3     bird       3.3

### SQL Files

In [6]:
import pandas as pd
import sqlite3

In [7]:
conn=sqlite3.connect('test_pandas.db')

In [8]:
sql_query="SELECT*FROM test"
data=pd.read_sql(sql_query,conn)

In [9]:
data

    id           city    mascot
0    1  San Francisco     49ers
1    2        Oakland   Raiders
2    3        Seattle  Seahawks
3    4        Chicago     Bears
4    5            NYC      Jets
5    6             LA      Rams
6    7            ANA  Chargers
7    6             LA      Rams
8    7            ANA  Chargers
9    6             LA      Rams
10   7            ANA  Chargers